---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.HvacRoughness
source: html/78d92aaf-3be7-4fef-530d-73bf9aa5e64a.htm
---
# Autodesk.Revit.DB.SpecTypeId.HvacRoughness Property

Roughness, in discipline HVAC.

## Syntax (C#)
```csharp
public static ForgeTypeId HvacRoughness { get; }
```